cases/cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  tofu
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0.01/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       287280;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       288880;
    }
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       290480;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       292080;
    }
    sides
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3200;
        startFace       293680;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          8952;
        startFace       296880;
    }
)

// ************************************************************************* //
